# Вычислить модуль числа

# А вот более серьезная магия подъехала
print("Программа вычислит модуль числа")
setChislo = int(input("Введите число, чей модуль скрыт для вашего разума: "))
if setChislo >= 0:
    print("Абракадабра!: \n", setChislo)
else:
    print("Абракадабра!: \n", setChislo * (-1))