'''Написать функцию, вычисляющую сумму двух переданных чисел.'''


def digSum(a, b):
    return a + b

print(digSum(4, 5))
