# Написать функцию, вычисляющую сумму двух переданных чисел.


def digSum(a, b):
    return sum(a, b)

print(digSum(4, 5))
