# Написать функцию, вычисляющую сумму двух переданных чисел.


def digSum(a, b):
    """Возвращает сумму двух аргументов"""
    return a + b


print(digSum(4, 5))
